name="mindia"
surname="sultanishvili"
age=35
colour="green"
print(name , surname , age , colour)


name="Saba"
age=16
print(name , age)

# High level- პროგრამირების ენა გულისხმობს ისეთ ენას, რომელიც ადამიანის ენასთან არის ახლოს(მაგ. პითონი)
# Low Lewel- პროგრამირებია ენა გულისხმობს ისეთ ენას, რომელიც კომპიუტერის ენასთან არის ახლოს.
# მონაცემთა ტიპები( Data types)
# string- ბჭყალებში მოცემული ნებისმიერი ინფორმაცია არის სტრინგი,გვჭირდება მაშინ როცა გვინდა ,რომ გამოვიტანოთ ტესტური ინფო.
# Integer- მთელი რიცხვი
# float- ათწილადი რიცხვი
# boolean- ლოგიკური მნიშვნელობა.ანუ მოცემულობა მართალია თუ მცდარი კომპიუტერისთვის.
# Print აღბეჭდავს კოდის გაშვების დროს მასში მოცემულ არგუმენტს.