# HTML - არის ძირითადი ენა , რომლის მეშვეობით იქმნება და სტრუქტურირდება ვებგვერდები. ის ეუბნება ბრაუზერს როგორ აჩვენოს ტექსტი, სურათი , ბმული და ასე შ.

# CSS - არის ენა, რომელიც გამოიყენება HTML-ის ელემენტების გასაფორმებლად და ვიზუალური სტილის მისაცემად. დიზაინი.

# Javascript - არის პროგრამის ენა, რომელიც ვებგვერდებს აძლევს ინტერაქტიულობას- ანუ რეაგირებს მომხმარებლის ქმედებაზე(კლიკი,ტექსტის შეყვანა და ასე შ.)

# <h1></h1> დან <h6></h6>  ჩათვლით , არის სათაურის თეგები, 6 სათაურის თეგია სულ.

# <p></p> - პარაგრაფის თეგი , გამოიყენება ტექსტის(აღწერის) დასაწერად.
# <button></button> გამოიყენება ღილაკის შესაქმნელად.

# <img>  გამოიყენება სურათის დასამატებლად ვებგვერდზე. აქვს ატრიბუტები src , alt , height , width